# -*- coding: utf-8 -*-
raw_xml = r'''<?xml version="1.0" encoding="Windows-1251"?><doc-list><doc><id>7CA067F51492EED1C225817900346347</id>
   <title>1-МЕТИЛ-2-((ФЕНІЛТІО)МЕТИЛ)-3-КАРБЕТОКСИ-4-((ДИМЕТИЛАМІНО)МЕТИЛ)-5-ГІДРОКСИ-6-БРОМІНДОЛ ГІДРОХЛОРИД (УМІФЕНОВІРУ ГІДРОХЛОРИД)</title>
   <form>порошок (субстанція) у подвійних пакетах з поліетилену для фармацевтичного застосування</form><mnn>Umifenovir</mnn>
   <mnntype></mnntype>
   <sklad>1-метил-2-((фенілтіо)метил)-3-карбетокси-4-((диметиламіно) метил)-5-гідрокси-6-броміндолу гідрохлориду від 99,0 % до 101,0 % (безводна речовина)</sklad>
   <fgroup>Субстанції.</fgroup>
   <atc1></atc1>
   <atc2></atc2>
   <atc3></atc3>
   <zt>ТОВ &quot;Фармацевтична компанія &quot;Здоров&apos;я&quot;</zt>
   <zc>Україна</zc>
   <za>Україна, 61013, м. Харків, вул. Шевченка, 22</za>
   <vcount>1</vcount>
   <vt1>Ченгду Хаоджи Фармчем Корпорейшн</vt1>
   <vc1>Китай</vc1>
   <va1>Вачезі Вілледж, Гуіксі Таун, Хаі Текнолоджі Індастріал Девелопмент Зон, Ченгду Сіті, Січуан Провінс</va1>
   <vt2></vt2>
   <vc2></vc2>
   <va2></va2>
   <vt3></vt3>
   <vc3></vc3>
   <va3></va3>
   <vt4></vt4>
   <vc4></vc4>
   <va4></va4>
   <vt5></vt5>
   <vc5></vc5>
   <va5></va5>
   <number>UA/10532/01/01</number>
   <begindate>07.07.2015</begindate>
   <enddate>07.07.2020</enddate>
   <stop>Ні</stop>
   <stopdate></stopdate>
   <stoptext></stoptext>
   <ltype></ltype>
   <per></per>
   <ucount>0</ucount>
   </doc><doc>
   <id>732FD7D57002E18AC22580960050F279</id>
   <title>2,3,4,5,6-ПЕНТАГІДРОКСИКАПРОНОВА КИСЛОТА, КАЛІЄВА СІЛЬ</title>
   <form>порошок (субстанція) в подвійних поліетиленових пакетах для виробництва стерильних та нестерильних лікарських форм</form>
   <mnn>Comb drug</mnn>
   <mnntype></mnntype>
   <sklad>2,3,4,5,6-пентагідроксикапронової кислоти, калієвої солі не менше 97,0 % і не більше 103,0 % в перерахунку на безводну речовину</sklad>
   <fgroup>Субстанції.</fgroup>
   <atc1></atc1>
   <atc2></atc2>
   <atc3></atc3>
   <zt>ПрАТ &quot;Фармацевтична фірма &quot;ФарКоС&quot;</zt>
   <zc>Україна</zc>
   <za>Україна, 03162, м. Київ, вул. Зодчих, 50-А</za>
   <vcount>1</vcount>
   <vt1>Глобал Кальціум Пвт. Лтд.</vt1>
   <vc1>Індія</vc1>
   <va1>адреса виробництва: 125 і 126, Сіпкот Промисловий Комплекс, Хозур-635126, Таміл Наду, Індія</va1>
   <vt2></vt2>
   <vc2></vc2>
   <va2></va2>
   <vt3></vt3>
   <vc3></vc3>
   <va3></va3>
   <vt4></vt4>
   <vc4></vc4>
   <va4></va4>
   <vt5></vt5>
   <vc5></vc5>
   <va5></va5>
   <number>UA/6169/01/01</number>
   <begindate>22.12.2016</begindate>
   <enddate>необмежений</enddate>
   <stop>Ні</stop>
   <stopdate></stopdate>
   <stoptext></stoptext>
   <ltype></ltype>
   <per></per>
   <ucount>0</ucount>
</doc></doc-list>'''